ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
<module name="CONTROLSS_CTRL" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL0" acronym="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL0" offset="4" width="32" description="Static crossbar for epwm select.">
		<bitfield id="EPWM_STATICXBAR_SEL0_EPWM15" width="2" begin="31" end="30" resetval="0x0" description="EPWM15 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="31:30" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM14" width="2" begin="29" end="28" resetval="0x0" description="EPWM14 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="29:28" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM13" width="2" begin="27" end="26" resetval="0x0" description="EPWM13 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="27:26" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM12" width="2" begin="25" end="24" resetval="0x0" description="EPWM12 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="25:24" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM11" width="2" begin="23" end="22" resetval="0x0" description="EPWM11 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="23:22" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM10" width="2" begin="21" end="20" resetval="0x0" description="EPWM10 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="21:20" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM9" width="2" begin="19" end="18" resetval="0x0" description="EPWM9 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="19:18" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM8" width="2" begin="17" end="16" resetval="0x0" description="EPWM8 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="17:16" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM7" width="2" begin="15" end="14" resetval="0x0" description="EPWM7 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="15:14" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM6" width="2" begin="13" end="12" resetval="0x0" description="EPWM6 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="13:12" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM5" width="2" begin="11" end="10" resetval="0x0" description="EPWM5 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="11:10" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM4" width="2" begin="9" end="8" resetval="0x0" description="EPWM4 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="9:8" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM3" width="2" begin="7" end="6" resetval="0x0" description="EPWM3 access from PCR grouping. Write the following value to access groups  -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="7:6" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM2" width="2" begin="5" end="4" resetval="0x0" description="EPWM2 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="5:4" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM1" width="2" begin="3" end="2" resetval="0x0" description="EPWM1 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="3:2" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM0" width="2" begin="1" end="0" resetval="0x0" description="EPWM0 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL1" acronym="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL1" offset="8" width="32" description="Static crossbar for epwm select.">
		<bitfield id="EPWM_STATICXBAR_SEL1_EPWM31" width="2" begin="31" end="30" resetval="0x0" description="EPWM31 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="31:30" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM30" width="2" begin="29" end="28" resetval="0x0" description="EPWM30 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="29:28" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM29" width="2" begin="27" end="26" resetval="0x0" description="EPWM29 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="27:26" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM28" width="2" begin="25" end="24" resetval="0x0" description="EPWM28 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="25:24" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM27" width="2" begin="23" end="22" resetval="0x0" description="EPWM27 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="23:22" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM26" width="2" begin="21" end="20" resetval="0x0" description="EPWM26 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="21:20" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM25" width="2" begin="19" end="18" resetval="0x0" description="EPWM25 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="19:18" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM24" width="2" begin="17" end="16" resetval="0x0" description="EPWM24 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="17:16" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM23" width="2" begin="15" end="14" resetval="0x0" description="EPWM23 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="15:14" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM22" width="2" begin="13" end="12" resetval="0x0" description="EPWM22 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="13:12" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM21" width="2" begin="11" end="10" resetval="0x0" description="EPWM21 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="11:10" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM20" width="2" begin="9" end="8" resetval="0x0" description="EPWM20 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="9:8" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM19" width="2" begin="7" end="6" resetval="0x0" description="EPWM19 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="7:6" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM18" width="2" begin="5" end="4" resetval="0x0" description="EPWM18 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="5:4" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM17" width="2" begin="3" end="2" resetval="0x0" description="EPWM17 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="3:2" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM16" width="2" begin="1" end="0" resetval="0x0" description="EPWM16 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM_CLKSYNC" acronym="CONTROLSS_CTRL_EPWM_CLKSYNC" offset="16" width="32" description="Epwm clock sync.">
		<bitfield id="EPWM_CLKSYNC_BIT" width="32" begin="31" end="0" resetval="0x0" description="EPWM clock sync for each EPWM instance. Set the bit corresponding to the instance number to enable that EPWM instance. When set, all enabled EPWM module clocks are started with the first rising edge of TBCLK aligned.Refer to TRM for more details.Writing 1'b1 will allow to enable corresponding EPWM instanceWriting 1'b0 will disable corresponding  EPWM instance." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_CLK0_SEL" acronym="CONTROLSS_CTRL_SDFM1_CLK0_SEL" offset="24" width="32" description="Sdfm1 clock select.">
		<bitfield id="SDFM1_CLK0_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM1 clock CK0 selectWrite 1'b0: source is SDFM1 CK0 from PinmuxWrite 1'b1: source is SDFM0 CK0 from Pinmux" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EMUSTOPN_MASK" acronym="CONTROLSS_CTRL_EMUSTOPN_MASK" offset="32" width="32" description="Bit-mask for debug suspend cpu cores to EPWM.">
		<bitfield id="EMUSTOPN_MASK_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM1'b0 : R5FSS1_CORE1 enabled to control EMUSTOPn1'b1 : R5FSS1_CORE1 disabled to control EMUSTOPn" range="3" rwaccess="R/W"/>
	<bitfield id="EMUSTOPN_MASK_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM1'b0 : R5FSS1_CORE0 enabled to control EMUSTOPn1'b1 : R5FSS1_CORE0 disabled to control EMUSTOPn" range="2" rwaccess="R/W"/>
	<bitfield id="EMUSTOPN_MASK_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM1'b0 : R5FSS0_CORE1 enabled to control EMUSTOPn1'b1 : R5FSS0_CORE1 disabled to control EMUSTOPn" range="1" rwaccess="R/W"/>
	<bitfield id="EMUSTOPN_MASK_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM1'b0 : R5FSS0_CORE0 enabled to control EMUSTOPn1'b1 : R5FSS0_CORE0 disabled to control EMUSTOPn" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CLB_AQ_EN0" acronym="CONTROLSS_CTRL_CLB_AQ_EN0" offset="40" width="32" description="clb_aq_en0.">
		<bitfield id="CLB_AQ_EN0_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_AQ signal of PWM[15:0]. Set Bitx to 1'b1 to enable it for PWMx. Here x varies from 0-15." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CLB_AQ_EN1" acronym="CONTROLSS_CTRL_CLB_AQ_EN1" offset="48" width="32" description="clb_aq_en1.">
		<bitfield id="CLB_AQ_EN1_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_AQ signal of PWM[31:16].Set Bitx to 1'b1 to enable it for PWMx. Here x varies from 16-31." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CLB_DB_EN0" acronym="CONTROLSS_CTRL_CLB_DB_EN0" offset="56" width="32" description="clb_db_en0.">
		<bitfield id="CLB_DB_EN0_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_DB signal of PWM[15:0]. Set Bitx to 1'b1 to enable it for PWMx. Here x varies from 0-15." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CLB_DB_EN1" acronym="CONTROLSS_CTRL_CLB_DB_EN1" offset="64" width="32" description="clb_db_en1.">
		<bitfield id="CLB_DB_EN1_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_DB signal of PWM[31:16].Set Bitx to 1'b1 to enable it for PWMx. Here x varies from 16-31." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCSOCFRCGBSEL" acronym="CONTROLSS_CTRL_ADCSOCFRCGBSEL" offset="68" width="32" description="ADC Global SoC Force select.">
		<bitfield id="ADCSOCFRCGBSEL_ENABLE" width="7" begin="6" end="0" resetval="0x0" description="ADCSOCFRCGBSEL has one bit for each ADCBIT    FIELD     Descriptionbitx    ADCx    Indicate if ADCx selected for global SW trigger                         1'b0 : Not selected for Global SW Trigger                         1'b1 : Selected for Global SW TriggerReset                          Reset type: SYSRSnNote: x represents 0-4" range="6:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCSOCFRCGB" acronym="CONTROLSS_CTRL_ADCSOCFRCGB" offset="72" width="32" description="ADC Global SOC Force.">
		<bitfield id="ADCSOCFRCGB_TRIG" width="16" begin="15" end="0" resetval="0x0" description="ADCSOCFRCGB has one bit for each SOC[Start of conversion]BIT      FIELD     Descriptionbitxx    SOCxx   Indicate if SOCxx selected for global SW trigger                           1'b0 : Not selected for Global SW Trigger                           1'b1 : Selected for Global SW Trigger                            Reset type: SYSRSnNote: xx represents 0-15" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_EXTCH_DLY_SEL" acronym="CONTROLSS_CTRL_ADC_EXTCH_DLY_SEL" offset="76" width="32" description="Mux select to choose delay for adc_extchsel.">
		<bitfield id="ADC_EXTCH_DLY_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="MUX select to choose delayWrite 1'b0: 3 cycle delay[default]Write 1'b1: 6 cycle delay" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_XBAR_LOOPBACK_CTRL" acronym="CONTROLSS_CTRL_XBAR_LOOPBACK_CTRL" offset="80" width="32" description="Mux select to enable Loopback for corresponding outputXBAR.">
		<bitfield id="XBAR_LOOPBACK_CTRL_ENABLE" width="16" begin="15" end="0" resetval="0x0" description="Mux select to enable Loopback for corresponding outputXBAR signal to the inputXBARWrite 1'b0: Loopback disabled [default]Write 1'b1: Loopback enable**Note: Each Mux select bit corresponds to the corresponding XBAR_LOOPBACK_CTRL_MUX" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM_SOCA_SEL" acronym="CONTROLSS_CTRL_EPWM_SOCA_SEL" offset="96" width="32" description="Select line to choose EPWM SOC A to EQEPx.SOCA and PWMBAR.">
		<bitfield id="EPWM_SOCA_SEL_SEL" width="32" begin="31" end="0" resetval="0x0" description="MUX select to choose EPWM SOC A to EQEPx.SOCA and PWMBAR.Each bit in SOC_A_SEL corresponds to each inputEPWM_SOCA_SEL_0:pwm_soca_0EPWM_SOCA_SEL_1:pwm_soca_1EPWM_SOCA_SEL_2:pwm_soca_2EPWM_SOCA_SEL_3:pwm_soca_3EPWM_SOCA_SEL_4:pwm_soca_4EPWM_SOCA_SEL_5:pwm_soca_5EPWM_SOCA_SEL_6:pwm_soca_6EPWM_SOCA_SEL_7:pwm_soca_7EPWM_SOCA_SEL_8:pwm_soca_8EPWM_SOCA_SEL_9:pwm_soca_9EPWM_SOCA_SEL_10:pwm_soca_10EPWM_SOCA_SEL_11:pwm_soca_11EPWM_SOCA_SEL_12:pwm_soca_12EPWM_SOCA_SEL_13:pwm_soca_13EPWM_SOCA_SEL_14:pwm_soca_14EPWM_SOCA_SEL_15:pwm_soca_15EPWM_SOCA_SEL_16:pwm_soca_16EPWM_SOCA_SEL_17:pwm_soca_17EPWM_SOCA_SEL_18:pwm_soca_18EPWM_SOCA_SEL_19:pwm_soca_19EPWM_SOCA_SEL_20:pwm_soca_20EPWM_SOCA_SEL_21:pwm_soca_21EPWM_SOCA_SEL_22:pwm_soca_22EPWM_SOCA_SEL_23:pwm_soca_23EPWM_SOCA_SEL_24:pwm_soca_24EPWM_SOCA_SEL_25:pwm_soca_25EPWM_SOCA_SEL_26:pwm_soca_26EPWM_SOCA_SEL_27:pwm_soca_27EPWM_SOCA_SEL_28:pwm_soca_28EPWM_SOCA_SEL_29:pwm_soca_29EPWM_SOCA_SEL_30:pwm_soca_30EPWM_SOCA_SEL_31:pwm_soca_31" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM_SOCB_SEL" acronym="CONTROLSS_CTRL_EPWM_SOCB_SEL" offset="100" width="32" description="Select line to choose EPWM SOC B to EQEPx.SOCB and PWMBAR.">
		<bitfield id="EPWM_SOCB_SEL_SEL" width="32" begin="31" end="0" resetval="0x0" description="MUX select to choose EPWM SOC B to EQEPx.SOCB and PWMBAR.Each bit in SOC_B_SEL corresponds to each inputEPWM_SOCB_SEL_0:pwm_socb_0EPWM_SOCB_SEL_1:pwm_socb_1EPWM_SOCB_SEL_2:pwm_socb_2EPWM_SOCB_SEL_3:pwm_socb_3EPWM_SOCB_SEL_4:pwm_socb_4EPWM_SOCB_SEL_5:pwm_socb_5EPWM_SOCB_SEL_6:pwm_socb_6EPWM_SOCB_SEL_7:pwm_socb_7EPWM_SOCB_SEL_8:pwm_socb_8EPWM_SOCB_SEL_9:pwm_socb_9EPWM_SOCB_SEL_10:pwm_socb_10EPWM_SOCB_SEL_11:pwm_socb_11EPWM_SOCB_SEL_12:pwm_socb_12EPWM_SOCB_SEL_13:pwm_socb_13EPWM_SOCB_SEL_14:pwm_socb_14EPWM_SOCB_SEL_15:pwm_socb_15EPWM_SOCB_SEL_16:pwm_socb_16EPWM_SOCB_SEL_17:pwm_socb_17EPWM_SOCB_SEL_18:pwm_socb_18EPWM_SOCB_SEL_19:pwm_socb_19EPWM_SOCB_SEL_20:pwm_socb_20EPWM_SOCB_SEL_21:pwm_socb_21EPWM_SOCB_SEL_22:pwm_socb_22EPWM_SOCB_SEL_23:pwm_socb_23EPWM_SOCB_SEL_24:pwm_socb_24EPWM_SOCB_SEL_25:pwm_socb_25EPWM_SOCB_SEL_26:pwm_socb_26EPWM_SOCB_SEL_27:pwm_socb_27EPWM_SOCB_SEL_28:pwm_socb_28EPWM_SOCB_SEL_29:pwm_socb_29EPWM_SOCB_SEL_30:pwm_socb_30EPWM_SOCB_SEL_31:pwm_socb_31" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR0_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR0_G0_SEL" offset="112" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR0_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR1_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR1_G0_SEL" offset="116" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR1_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR2_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR2_G0_SEL" offset="120" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR2_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR3_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR3_G0_SEL" offset="124" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR3_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR4_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR4_G0_SEL" offset="128" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR4_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR5_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR5_G0_SEL" offset="132" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR5_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR6_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR6_G0_SEL" offset="136" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR6_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR7_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR7_G0_SEL" offset="140" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR7_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
