ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR8_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR8_G0_SEL" offset="144" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR8_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCEXTCHXBAR9_G0_SEL" acronym="CONTROLSS_CTRL_ADCEXTCHXBAR9_G0_SEL" offset="148" width="32" description="ADC EXTCH XBAR [x] Input Select.">
		<bitfield id="ADCEXTCHXBAR9_G0_SEL_SEL" width="4" begin="3" end="0" resetval="0x0" description="ADC EXTCH XBAR 0 Input Select4'b0000: ADC0EXTCHSEL_BIT04'b0001: ADC0EXTCHSEL_BIT14'b0010: ADC1EXTCHSEL_BIT04'b0011: ADC1EXTCHSEL_BIT14'b0100: ADC2EXTCHSEL_BIT04'b0101: ADC2EXTCHSEL_BIT14'b0110: ADC3EXTCHSEL_BIT04'b0111: ADC3EXTCHSEL_BIT14'b1000: ADC4EXTCHSEL_BIT04'b1001: ADC4EXTCHSEL_BIT14'b1010: ADC_R0_EXTCHSEL_BIT04'b1011: ADC_R0_EXTCHSEL_BIT14'b1100: ADC_R1_EXTCHSEL_BIT04'b1101: ADC_R1_EXTCHSEL_BIT1Example: ADC2EXTCHSEL_BIT0 needs to be connect to ADC_EXTCH_XBAROUT3, then ADCEXTCHXBAR3.G0.SEL set to 4'b0100" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM0_CLK0_OUT_SEL" acronym="CONTROLSS_CTRL_SDFM0_CLK0_OUT_SEL" offset="176" width="32" description="SDFM0_CLK[x]_OUT Input Select.">
		<bitfield id="SDFM0_CLK0_OUT_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM0_CLK0_OUT Input selectWrite 1'b0: ECAP4_OUT [default]Write 1'b1: ECAP12_OUT" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM0_CLK1_OUT_SEL" acronym="CONTROLSS_CTRL_SDFM0_CLK1_OUT_SEL" offset="180" width="32" description="SDFM0_CLK[x]_OUT Input Select.">
		<bitfield id="SDFM0_CLK1_OUT_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM0_CLK1_OUT Input selectWrite 1'b0: ECAP5_OUT [default]Write 1'b1: ECAP13_OUT" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM0_CLK2_OUT_SEL" acronym="CONTROLSS_CTRL_SDFM0_CLK2_OUT_SEL" offset="184" width="32" description="SDFM0_CLK[x]_OUT Input Select.">
		<bitfield id="SDFM0_CLK2_OUT_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM0_CLK2_OUT Input selectWrite 1'b0: ECAP6_OUT [default]Write 1'b1: ECAP14_OUT" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM0_CLK3_OUT_SEL" acronym="CONTROLSS_CTRL_SDFM0_CLK3_OUT_SEL" offset="188" width="32" description="SDFM0_CLK[x]_OUT Input Select.">
		<bitfield id="SDFM0_CLK3_OUT_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM0_CLK3_OUT Input selectWrite 1'b0: ECAP7_OUT [default]Write 1'b1: ECAP15_OUT" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_CLK0_OUT_SEL" acronym="CONTROLSS_CTRL_SDFM1_CLK0_OUT_SEL" offset="192" width="32" description="SDFM1_CLK[x]_OUT Input Select.">
		<bitfield id="SDFM1_CLK0_OUT_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM1_CLK0_OUT Input selectWrite 1'b0: ECAP7_OUT [default]Write 1'b1: ECAP15_OUT" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_CLK1_OUT_SEL" acronym="CONTROLSS_CTRL_SDFM1_CLK1_OUT_SEL" offset="196" width="32" description="SDFM1_CLK[x]_OUT Input Select.">
		<bitfield id="SDFM1_CLK1_OUT_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM1_CLK1_OUT Input selectWrite 1'b0: ECAP6_OUT [default]Write 1'b1: ECAP14_OUT" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_CLK2_OUT_SEL" acronym="CONTROLSS_CTRL_SDFM1_CLK2_OUT_SEL" offset="200" width="32" description="SDFM1_CLK[x]_OUT Input Select.">
		<bitfield id="SDFM1_CLK2_OUT_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM1_CLK2_OUT Input selectWrite 1'b0: ECAP5_OUT [default]Write 1'b1: ECAP13_OUT" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_CLK3_OUT_SEL" acronym="CONTROLSS_CTRL_SDFM1_CLK3_OUT_SEL" offset="204" width="32" description="SDFM1_CLK[x]_OUT Input Select.">
		<bitfield id="SDFM1_CLK3_OUT_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM1_CLK3_OUT Input selectWrite 1'b0: ECAP4_OUT [default]Write 1'b1: ECAP12_OUT" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CONTROLSS_G0_EPWM_WLINK" acronym="CONTROLSS_CTRL_CONTROLSS_G0_EPWM_WLINK" offset="224" width="32" description="Enable for WLINK of EPWM groups.">
		<bitfield id="CONTROLSS_G0_EPWM_WLINK_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Writing 1'b1 to the bit enables the corresponding EPWM instance for WLINK feature" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CONTROLSS_G1_EPWM_WLINK" acronym="CONTROLSS_CTRL_CONTROLSS_G1_EPWM_WLINK" offset="228" width="32" description="Enable for WLINK of EPWM groups.">
		<bitfield id="CONTROLSS_G1_EPWM_WLINK_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Writing 1'b1 to the bit enables the corresponding EPWM instance for WLINK feature" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CONTROLSS_G2_EPWM_WLINK" acronym="CONTROLSS_CTRL_CONTROLSS_G2_EPWM_WLINK" offset="232" width="32" description="Enable for WLINK of EPWM groups.">
		<bitfield id="CONTROLSS_G2_EPWM_WLINK_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Writing 1'b1 to the bit enables the corresponding EPWM instance for WLINK feature" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CONTROLSS_G3_EPWM_WLINK" acronym="CONTROLSS_CTRL_CONTROLSS_G3_EPWM_WLINK" offset="236" width="32" description="Enable for WLINK of EPWM groups.">
		<bitfield id="CONTROLSS_G3_EPWM_WLINK_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Writing 1'b1 to the bit enables the corresponding EPWM instance for WLINK feature" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM0_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM0_CLK_GATE" offset="256" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM1_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM1_CLK_GATE" offset="260" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM2_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM2_CLK_GATE" offset="264" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM3_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM3_CLK_GATE" offset="268" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM4_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM4_CLK_GATE" offset="272" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM5_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM5_CLK_GATE" offset="276" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM5_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM6_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM6_CLK_GATE" offset="280" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM6_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM7_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM7_CLK_GATE" offset="284" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM7_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM8_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM8_CLK_GATE" offset="288" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM8_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM9_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM9_CLK_GATE" offset="292" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM9_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM10_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM10_CLK_GATE" offset="296" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM10_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM11_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM11_CLK_GATE" offset="300" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM11_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM12_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM12_CLK_GATE" offset="304" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM12_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM13_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM13_CLK_GATE" offset="308" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM13_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM14_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM14_CLK_GATE" offset="312" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM14_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM15_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM15_CLK_GATE" offset="316" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM15_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM16_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM16_CLK_GATE" offset="320" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM16_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM17_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM17_CLK_GATE" offset="324" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM17_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM18_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM18_CLK_GATE" offset="328" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM18_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM19_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM19_CLK_GATE" offset="332" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM19_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM20_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM20_CLK_GATE" offset="336" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM20_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM21_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM21_CLK_GATE" offset="340" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM21_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM22_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM22_CLK_GATE" offset="344" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM22_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM23_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM23_CLK_GATE" offset="348" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM23_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM24_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM24_CLK_GATE" offset="352" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM24_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM25_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM25_CLK_GATE" offset="356" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM25_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM26_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM26_CLK_GATE" offset="360" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM26_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM27_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM27_CLK_GATE" offset="364" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM27_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM28_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM28_CLK_GATE" offset="368" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM28_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM29_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM29_CLK_GATE" offset="372" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM29_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM30_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM30_CLK_GATE" offset="376" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM30_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM31_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM31_CLK_GATE" offset="380" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM31_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX0_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX0_CLK_GATE" offset="384" width="32" description="fsi_tx[x] clock gate.">
		<bitfield id="FSI_TX0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX1_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX1_CLK_GATE" offset="388" width="32" description="fsi_tx[x] clock gate.">
		<bitfield id="FSI_TX1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX2_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX2_CLK_GATE" offset="392" width="32" description="fsi_tx[x] clock gate.">
		<bitfield id="FSI_TX2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX3_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX3_CLK_GATE" offset="396" width="32" description="fsi_tx[x] clock gate.">
		<bitfield id="FSI_TX3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX0_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX0_CLK_GATE" offset="400" width="32" description="fsi_rx[x] clock gate.">
		<bitfield id="FSI_RX0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX1_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX1_CLK_GATE" offset="404" width="32" description="fsi_rx[x] clock gate.">
		<bitfield id="FSI_RX1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX2_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX2_CLK_GATE" offset="408" width="32" description="fsi_rx[x] clock gate.">
		<bitfield id="FSI_RX2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX3_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX3_CLK_GATE" offset="412" width="32" description="fsi_rx[x] clock gate.">
		<bitfield id="FSI_RX3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA0_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA0_CLK_GATE" offset="416" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA1_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA1_CLK_GATE" offset="420" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA2_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA2_CLK_GATE" offset="424" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA3_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA3_CLK_GATE" offset="428" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA4_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA4_CLK_GATE" offset="432" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA5_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA5_CLK_GATE" offset="436" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA5_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA6_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA6_CLK_GATE" offset="440" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA6_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA7_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA7_CLK_GATE" offset="444" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA7_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA8_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA8_CLK_GATE" offset="448" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA8_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA9_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA9_CLK_GATE" offset="452" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA9_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB0_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB0_CLK_GATE" offset="464" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
