ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
	</register><register id="CONTROLSS_CTRL_CMPSSB1_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB1_CLK_GATE" offset="468" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB2_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB2_CLK_GATE" offset="472" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB3_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB3_CLK_GATE" offset="476" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB4_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB4_CLK_GATE" offset="480" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB5_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB5_CLK_GATE" offset="484" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB5_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB6_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB6_CLK_GATE" offset="488" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB6_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB7_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB7_CLK_GATE" offset="492" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB7_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB8_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB8_CLK_GATE" offset="496" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB8_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB9_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB9_CLK_GATE" offset="500" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB9_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP0_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP0_CLK_GATE" offset="512" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP1_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP1_CLK_GATE" offset="516" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP2_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP2_CLK_GATE" offset="520" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP3_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP3_CLK_GATE" offset="524" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP4_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP4_CLK_GATE" offset="528" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP5_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP5_CLK_GATE" offset="532" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP5_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP6_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP6_CLK_GATE" offset="536" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP6_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP7_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP7_CLK_GATE" offset="540" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP7_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP8_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP8_CLK_GATE" offset="544" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP8_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP9_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP9_CLK_GATE" offset="548" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP9_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP10_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP10_CLK_GATE" offset="552" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP10_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP11_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP11_CLK_GATE" offset="556" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP11_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP12_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP12_CLK_GATE" offset="560" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP12_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP13_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP13_CLK_GATE" offset="564" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP13_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP14_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP14_CLK_GATE" offset="568" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP14_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP15_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP15_CLK_GATE" offset="572" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP15_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP0_CLK_GATE" acronym="CONTROLSS_CTRL_EQEP0_CLK_GATE" offset="576" width="32" description="Eqep[x] clock gate.">
		<bitfield id="EQEP0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding eqep" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP1_CLK_GATE" acronym="CONTROLSS_CTRL_EQEP1_CLK_GATE" offset="580" width="32" description="Eqep[x] clock gate.">
		<bitfield id="EQEP1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding eqep" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP2_CLK_GATE" acronym="CONTROLSS_CTRL_EQEP2_CLK_GATE" offset="584" width="32" description="Eqep[x] clock gate.">
		<bitfield id="EQEP2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding eqep" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM0_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM0_CLK_GATE" offset="592" width="32" description="Sdfm[x] clock gate.">
		<bitfield id="SDFM0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding sdfm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM1_CLK_GATE" offset="596" width="32" description="Sdfm[x] clock gate.">
		<bitfield id="SDFM1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding sdfm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_DAC_CLK_GATE" acronym="CONTROLSS_CTRL_DAC_CLK_GATE" offset="600" width="32" description="dac clock gate.">
		<bitfield id="DAC_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for dac" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC0_CLK_GATE" acronym="CONTROLSS_CTRL_ADC0_CLK_GATE" offset="604" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC1_CLK_GATE" acronym="CONTROLSS_CTRL_ADC1_CLK_GATE" offset="608" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC2_CLK_GATE" acronym="CONTROLSS_CTRL_ADC2_CLK_GATE" offset="612" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC3_CLK_GATE" acronym="CONTROLSS_CTRL_ADC3_CLK_GATE" offset="616" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC4_CLK_GATE" acronym="CONTROLSS_CTRL_ADC4_CLK_GATE" offset="620" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO0_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO0_CLK_GATE" offset="624" width="32" description="Otto[x] clock gate.">
		<bitfield id="OTTO0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO1_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO1_CLK_GATE" offset="628" width="32" description="Otto[x] clock gate.">
		<bitfield id="OTTO1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO2_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO2_CLK_GATE" offset="632" width="32" description="Otto[x] clock gate.">
		<bitfield id="OTTO2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO3_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO3_CLK_GATE" offset="636" width="32" description="Otto[x] clock gate.">
		<bitfield id="OTTO3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM0_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM0_PLL_CLK_GATE" offset="640" width="32" description="Sdfm[x]_pll clock gate.">
		<bitfield id="SDFM0_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding sdfm pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM1_PLL_CLK_GATE" offset="644" width="32" description="Sdfm[x]_pll clock gate.">
		<bitfield id="SDFM1_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding sdfm pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX0_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX0_PLL_CLK_GATE" offset="648" width="32" description="fsi_tx[x]_pll clock gate.">
		<bitfield id="FSI_TX0_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi rx pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX1_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX1_PLL_CLK_GATE" offset="652" width="32" description="fsi_tx[x]_pll clock gate.">
		<bitfield id="FSI_TX1_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi rx pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX2_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX2_PLL_CLK_GATE" offset="656" width="32" description="fsi_tx[x]_pll clock gate.">
		<bitfield id="FSI_TX2_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi rx pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX3_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX3_PLL_CLK_GATE" offset="660" width="32" description="fsi_tx[x]_pll clock gate.">
		<bitfield id="FSI_TX3_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi rx pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_HW_RESOLVER_CLK_GATE" acronym="CONTROLSS_CTRL_HW_RESOLVER_CLK_GATE" offset="664" width="32" description="Hardware resolver clock gate.">
		<bitfield id="HW_RESOLVER_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding hw_resolver" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE0_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE0_CLK_GATE" offset="668" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE1_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE1_CLK_GATE" offset="672" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE2_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE2_CLK_GATE" offset="676" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE3_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE3_CLK_GATE" offset="680" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE4_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE4_CLK_GATE" offset="684" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE5_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE5_CLK_GATE" offset="688" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE5_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE6_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE6_CLK_GATE" offset="692" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE6_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE7_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE7_CLK_GATE" offset="696" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE7_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE8_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE8_CLK_GATE" offset="700" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE8_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE9_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE9_CLK_GATE" offset="704" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE9_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE10_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE10_CLK_GATE" offset="708" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE10_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE11_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_SCTILE11_CLK_GATE" offset="712" width="32" description="ADC Safecheck tiles clock gate.">
		<bitfield id="ADC_SCTILE11_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_AGG0_CLK_GATE" acronym="CONTROLSS_CTRL_ADC_AGG0_CLK_GATE" offset="732" width="32" description="ADC Aggregator clock gate.">
		<bitfield id="ADC_AGG0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc aggregator" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CONTROLSS_XBAR_CLK_GATE" acronym="CONTROLSS_CTRL_CONTROLSS_XBAR_CLK_GATE" offset="736" width="32" description="clock gate for eight XBARs.">
		<bitfield id="CONTROLSS_XBAR_CLK_GATE_PWMSYNCOUTXBAR" width="3" begin="30" end="28" resetval="0x0" description="Writing 3'b111 to register will clock gate the corresponding XBAR" range="30:28" rwaccess="R/W"/>
	<bitfield id="CONTROLSS_XBAR_CLK_GATE_OUTPUTXBAR" width="3" begin="26" end="24" resetval="0x0" description="Writing 3'b111 to register will clock gate the corresponding XBAR" range="26:24" rwaccess="R/W"/>
	<bitfield id="CONTROLSS_XBAR_CLK_GATE_DMAXBAR" width="3" begin="22" end="20" resetval="0x0" description="Writing 3'b111 to register will clock gate the corresponding XBAR" range="22:20" rwaccess="R/W"/>
	<bitfield id="CONTROLSS_XBAR_CLK_GATE_INTXBAR" width="3" begin="18" end="16" resetval="0x0" description="Writing 3'b111 to register will clock gate the corresponding XBAR" range="18:16" rwaccess="R/W"/>
	<bitfield id="CONTROLSS_XBAR_CLK_GATE_ICLXBAR" width="3" begin="14" end="12" resetval="0x0" description="Writing 3'b111 to register will clock gate the corresponding XBAR" range="14:12" rwaccess="R/W"/>
	<bitfield id="CONTROLSS_XBAR_CLK_GATE_MDLXBAR" width="3" begin="10" end="8" resetval="0x0" description="Writing 3'b111 to register will clock gate the corresponding XBAR" range="10:8" rwaccess="R/W"/>
	<bitfield id="CONTROLSS_XBAR_CLK_GATE_PWMXBAR" width="3" begin="6" end="4" resetval="0x0" description="Writing 3'b111 to register will clock gate the corresponding XBAR" range="6:4" rwaccess="R/W"/>
	<bitfield id="CONTROLSS_XBAR_CLK_GATE_INPUTXBAR" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 to register will clock gate the corresponding XBAR" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCR0_CLK_GATE" acronym="CONTROLSS_CTRL_ADCR0_CLK_GATE" offset="740" width="32" description="Adcr[x] clock gate.">
		<bitfield id="ADCR0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCR1_CLK_GATE" acronym="CONTROLSS_CTRL_ADCR1_CLK_GATE" offset="744" width="32" description="Adcr[x] clock gate.">
		<bitfield id="ADCR1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM0_RST" acronym="CONTROLSS_CTRL_EPWM0_RST" offset="768" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM1_RST" acronym="CONTROLSS_CTRL_EPWM1_RST" offset="772" width="32" description="Epwm[x]_reset.">
