ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
		<bitfield id="EPWM1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM2_RST" acronym="CONTROLSS_CTRL_EPWM2_RST" offset="776" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM3_RST" acronym="CONTROLSS_CTRL_EPWM3_RST" offset="780" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM4_RST" acronym="CONTROLSS_CTRL_EPWM4_RST" offset="784" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM4_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM5_RST" acronym="CONTROLSS_CTRL_EPWM5_RST" offset="788" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM5_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM6_RST" acronym="CONTROLSS_CTRL_EPWM6_RST" offset="792" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM6_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM7_RST" acronym="CONTROLSS_CTRL_EPWM7_RST" offset="796" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM7_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM8_RST" acronym="CONTROLSS_CTRL_EPWM8_RST" offset="800" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM8_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM9_RST" acronym="CONTROLSS_CTRL_EPWM9_RST" offset="804" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM9_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM10_RST" acronym="CONTROLSS_CTRL_EPWM10_RST" offset="808" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM10_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM11_RST" acronym="CONTROLSS_CTRL_EPWM11_RST" offset="812" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM11_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM12_RST" acronym="CONTROLSS_CTRL_EPWM12_RST" offset="816" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM12_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM13_RST" acronym="CONTROLSS_CTRL_EPWM13_RST" offset="820" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM13_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM14_RST" acronym="CONTROLSS_CTRL_EPWM14_RST" offset="824" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM14_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM15_RST" acronym="CONTROLSS_CTRL_EPWM15_RST" offset="828" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM15_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM16_RST" acronym="CONTROLSS_CTRL_EPWM16_RST" offset="832" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM16_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM17_RST" acronym="CONTROLSS_CTRL_EPWM17_RST" offset="836" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM17_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM18_RST" acronym="CONTROLSS_CTRL_EPWM18_RST" offset="840" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM18_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM19_RST" acronym="CONTROLSS_CTRL_EPWM19_RST" offset="844" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM19_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM20_RST" acronym="CONTROLSS_CTRL_EPWM20_RST" offset="848" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM20_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM21_RST" acronym="CONTROLSS_CTRL_EPWM21_RST" offset="852" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM21_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM22_RST" acronym="CONTROLSS_CTRL_EPWM22_RST" offset="856" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM22_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM23_RST" acronym="CONTROLSS_CTRL_EPWM23_RST" offset="860" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM23_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM24_RST" acronym="CONTROLSS_CTRL_EPWM24_RST" offset="864" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM24_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM25_RST" acronym="CONTROLSS_CTRL_EPWM25_RST" offset="868" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM25_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM26_RST" acronym="CONTROLSS_CTRL_EPWM26_RST" offset="872" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM26_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM27_RST" acronym="CONTROLSS_CTRL_EPWM27_RST" offset="876" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM27_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM28_RST" acronym="CONTROLSS_CTRL_EPWM28_RST" offset="880" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM28_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM29_RST" acronym="CONTROLSS_CTRL_EPWM29_RST" offset="884" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM29_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM30_RST" acronym="CONTROLSS_CTRL_EPWM30_RST" offset="888" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM30_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM31_RST" acronym="CONTROLSS_CTRL_EPWM31_RST" offset="892" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM31_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX0_RST" acronym="CONTROLSS_CTRL_FSI_TX0_RST" offset="896" width="32" description="fsi_tx[x]_reset.">
		<bitfield id="FSI_TX0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX1_RST" acronym="CONTROLSS_CTRL_FSI_TX1_RST" offset="900" width="32" description="fsi_tx[x]_reset.">
		<bitfield id="FSI_TX1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX2_RST" acronym="CONTROLSS_CTRL_FSI_TX2_RST" offset="904" width="32" description="fsi_tx[x]_reset.">
		<bitfield id="FSI_TX2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX3_RST" acronym="CONTROLSS_CTRL_FSI_TX3_RST" offset="908" width="32" description="fsi_tx[x]_reset.">
		<bitfield id="FSI_TX3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX0_RST" acronym="CONTROLSS_CTRL_FSI_RX0_RST" offset="912" width="32" description="fsi_rx[x]_reset.">
		<bitfield id="FSI_RX0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX1_RST" acronym="CONTROLSS_CTRL_FSI_RX1_RST" offset="916" width="32" description="fsi_rx[x]_reset.">
		<bitfield id="FSI_RX1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX2_RST" acronym="CONTROLSS_CTRL_FSI_RX2_RST" offset="920" width="32" description="fsi_rx[x]_reset.">
		<bitfield id="FSI_RX2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX3_RST" acronym="CONTROLSS_CTRL_FSI_RX3_RST" offset="924" width="32" description="fsi_rx[x]_reset.">
		<bitfield id="FSI_RX3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA0_RST" acronym="CONTROLSS_CTRL_CMPSSA0_RST" offset="928" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA1_RST" acronym="CONTROLSS_CTRL_CMPSSA1_RST" offset="932" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA2_RST" acronym="CONTROLSS_CTRL_CMPSSA2_RST" offset="936" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA3_RST" acronym="CONTROLSS_CTRL_CMPSSA3_RST" offset="940" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA4_RST" acronym="CONTROLSS_CTRL_CMPSSA4_RST" offset="944" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA4_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA5_RST" acronym="CONTROLSS_CTRL_CMPSSA5_RST" offset="948" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA5_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA6_RST" acronym="CONTROLSS_CTRL_CMPSSA6_RST" offset="952" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA6_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA7_RST" acronym="CONTROLSS_CTRL_CMPSSA7_RST" offset="956" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA7_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA8_RST" acronym="CONTROLSS_CTRL_CMPSSA8_RST" offset="960" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA8_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA9_RST" acronym="CONTROLSS_CTRL_CMPSSA9_RST" offset="964" width="32" description="cmpssa[x]_reset.">
		<bitfield id="CMPSSA9_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB0_RST" acronym="CONTROLSS_CTRL_CMPSSB0_RST" offset="976" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB1_RST" acronym="CONTROLSS_CTRL_CMPSSB1_RST" offset="980" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB2_RST" acronym="CONTROLSS_CTRL_CMPSSB2_RST" offset="984" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB3_RST" acronym="CONTROLSS_CTRL_CMPSSB3_RST" offset="988" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB4_RST" acronym="CONTROLSS_CTRL_CMPSSB4_RST" offset="992" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB4_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB5_RST" acronym="CONTROLSS_CTRL_CMPSSB5_RST" offset="996" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB5_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB6_RST" acronym="CONTROLSS_CTRL_CMPSSB6_RST" offset="1000" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB6_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB7_RST" acronym="CONTROLSS_CTRL_CMPSSB7_RST" offset="1004" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB7_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB8_RST" acronym="CONTROLSS_CTRL_CMPSSB8_RST" offset="1008" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB8_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB9_RST" acronym="CONTROLSS_CTRL_CMPSSB9_RST" offset="1012" width="32" description="cmpssb[x]_reset.">
		<bitfield id="CMPSSB9_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP0_RST" acronym="CONTROLSS_CTRL_ECAP0_RST" offset="1024" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP1_RST" acronym="CONTROLSS_CTRL_ECAP1_RST" offset="1028" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP2_RST" acronym="CONTROLSS_CTRL_ECAP2_RST" offset="1032" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP3_RST" acronym="CONTROLSS_CTRL_ECAP3_RST" offset="1036" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP4_RST" acronym="CONTROLSS_CTRL_ECAP4_RST" offset="1040" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP4_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP5_RST" acronym="CONTROLSS_CTRL_ECAP5_RST" offset="1044" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP5_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP6_RST" acronym="CONTROLSS_CTRL_ECAP6_RST" offset="1048" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP6_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP7_RST" acronym="CONTROLSS_CTRL_ECAP7_RST" offset="1052" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP7_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP8_RST" acronym="CONTROLSS_CTRL_ECAP8_RST" offset="1056" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP8_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP9_RST" acronym="CONTROLSS_CTRL_ECAP9_RST" offset="1060" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP9_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP10_RST" acronym="CONTROLSS_CTRL_ECAP10_RST" offset="1064" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP10_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP11_RST" acronym="CONTROLSS_CTRL_ECAP11_RST" offset="1068" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP11_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP12_RST" acronym="CONTROLSS_CTRL_ECAP12_RST" offset="1072" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP12_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP13_RST" acronym="CONTROLSS_CTRL_ECAP13_RST" offset="1076" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP13_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP14_RST" acronym="CONTROLSS_CTRL_ECAP14_RST" offset="1080" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP14_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP15_RST" acronym="CONTROLSS_CTRL_ECAP15_RST" offset="1084" width="32" description="Ecap[x]_reset.">
		<bitfield id="ECAP15_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding ecap" range="2:0" rwaccess="R/W"/>
