ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
	</register><register id="CONTROLSS_CTRL_EQEP0_RST" acronym="CONTROLSS_CTRL_EQEP0_RST" offset="1088" width="32" description="Eqep[x]_reset.">
		<bitfield id="EQEP0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding eqep" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP1_RST" acronym="CONTROLSS_CTRL_EQEP1_RST" offset="1092" width="32" description="Eqep[x]_reset.">
		<bitfield id="EQEP1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding eqep" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP2_RST" acronym="CONTROLSS_CTRL_EQEP2_RST" offset="1096" width="32" description="Eqep[x]_reset.">
		<bitfield id="EQEP2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding eqep" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM0_RST" acronym="CONTROLSS_CTRL_SDFM0_RST" offset="1104" width="32" description="Sdfm[x]_reset.">
		<bitfield id="SDFM0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding sdfm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_RST" acronym="CONTROLSS_CTRL_SDFM1_RST" offset="1108" width="32" description="Sdfm[x]_reset.">
		<bitfield id="SDFM1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding sdfm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_DAC_RST" acronym="CONTROLSS_CTRL_DAC_RST" offset="1112" width="32" description="dac_reset.">
		<bitfield id="DAC_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for dac" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC0_RST" acronym="CONTROLSS_CTRL_ADC0_RST" offset="1116" width="32" description="Adc[x]_reset.">
		<bitfield id="ADC0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC1_RST" acronym="CONTROLSS_CTRL_ADC1_RST" offset="1120" width="32" description="Adc[x]_reset.">
		<bitfield id="ADC1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC2_RST" acronym="CONTROLSS_CTRL_ADC2_RST" offset="1124" width="32" description="Adc[x]_reset.">
		<bitfield id="ADC2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC3_RST" acronym="CONTROLSS_CTRL_ADC3_RST" offset="1128" width="32" description="Adc[x]_reset.">
		<bitfield id="ADC3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC4_RST" acronym="CONTROLSS_CTRL_ADC4_RST" offset="1132" width="32" description="Adc[x]_reset.">
		<bitfield id="ADC4_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO0_RST" acronym="CONTROLSS_CTRL_OTTO0_RST" offset="1136" width="32" description="Otto[x]_reset.">
		<bitfield id="OTTO0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO1_RST" acronym="CONTROLSS_CTRL_OTTO1_RST" offset="1140" width="32" description="Otto[x]_reset.">
		<bitfield id="OTTO1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO2_RST" acronym="CONTROLSS_CTRL_OTTO2_RST" offset="1144" width="32" description="Otto[x]_reset.">
		<bitfield id="OTTO2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO3_RST" acronym="CONTROLSS_CTRL_OTTO3_RST" offset="1148" width="32" description="Otto[x]_reset.">
		<bitfield id="OTTO3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_HW_RESOLVER_RST" acronym="CONTROLSS_CTRL_HW_RESOLVER_RST" offset="1152" width="32" description="Hardware resolver reset.">
		<bitfield id="HW_RESOLVER_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding hw_resolver" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE0_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE0_RST" offset="1156" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE1_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE1_RST" offset="1160" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE2_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE2_RST" offset="1164" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE3_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE3_RST" offset="1168" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE4_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE4_RST" offset="1172" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE4_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE5_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE5_RST" offset="1176" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE5_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE6_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE6_RST" offset="1180" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE6_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE7_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE7_RST" offset="1184" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE7_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE8_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE8_RST" offset="1188" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE8_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE9_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE9_RST" offset="1192" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE9_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE10_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE10_RST" offset="1196" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE10_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_SCTILE11_RST" acronym="CONTROLSS_CTRL_ADC_SCTILE11_RST" offset="1200" width="32" description="ADC Safecheck tiles Reset.">
		<bitfield id="ADC_SCTILE11_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc safety tiles" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC_AGG0_RST" acronym="CONTROLSS_CTRL_ADC_AGG0_RST" offset="1220" width="32" description="ADC Aggregator Reset.">
		<bitfield id="ADC_AGG0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc aggregator" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCR0_RST" acronym="CONTROLSS_CTRL_ADCR0_RST" offset="1224" width="32" description="Adcr[x] reset.">
		<bitfield id="ADCR0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADCR1_RST" acronym="CONTROLSS_CTRL_ADCR1_RST" offset="1228" width="32" description="Adcr[x] reset.">
		<bitfield id="ADCR1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM0_HALTEN" acronym="CONTROLSS_CTRL_EPWM0_HALTEN" offset="1280" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM0_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM0_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM0_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM0_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM1_HALTEN" acronym="CONTROLSS_CTRL_EPWM1_HALTEN" offset="1284" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM1_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM1_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM1_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM1_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM2_HALTEN" acronym="CONTROLSS_CTRL_EPWM2_HALTEN" offset="1288" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM2_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM2_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM2_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM2_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM3_HALTEN" acronym="CONTROLSS_CTRL_EPWM3_HALTEN" offset="1292" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM3_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM3_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM3_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM3_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM4_HALTEN" acronym="CONTROLSS_CTRL_EPWM4_HALTEN" offset="1296" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM4_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM4_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM4_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM4_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM5_HALTEN" acronym="CONTROLSS_CTRL_EPWM5_HALTEN" offset="1300" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM5_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM5_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM5_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM5_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM6_HALTEN" acronym="CONTROLSS_CTRL_EPWM6_HALTEN" offset="1304" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM6_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM6_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM6_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM6_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM7_HALTEN" acronym="CONTROLSS_CTRL_EPWM7_HALTEN" offset="1308" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM7_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM7_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM7_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM7_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM8_HALTEN" acronym="CONTROLSS_CTRL_EPWM8_HALTEN" offset="1312" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM8_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM8_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM8_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM8_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM9_HALTEN" acronym="CONTROLSS_CTRL_EPWM9_HALTEN" offset="1316" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM9_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM9_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM9_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM9_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM10_HALTEN" acronym="CONTROLSS_CTRL_EPWM10_HALTEN" offset="1320" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM10_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM10_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM10_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM10_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM11_HALTEN" acronym="CONTROLSS_CTRL_EPWM11_HALTEN" offset="1324" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM11_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM11_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM11_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM11_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM12_HALTEN" acronym="CONTROLSS_CTRL_EPWM12_HALTEN" offset="1328" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM12_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM12_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
