ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
	<bitfield id="CMPSSA2_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA2_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA3_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA3_HALTEN" offset="1420" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA3_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA3_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA3_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA3_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA4_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA4_HALTEN" offset="1424" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA4_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA4_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA4_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA4_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA5_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA5_HALTEN" offset="1428" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA5_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA5_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA5_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA5_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA6_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA6_HALTEN" offset="1432" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA6_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA6_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA6_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA6_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA7_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA7_HALTEN" offset="1436" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA7_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA7_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA7_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA7_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA8_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA8_HALTEN" offset="1440" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA8_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA8_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA8_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA8_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA9_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA9_HALTEN" offset="1444" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA9_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA9_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA9_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA9_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB0_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB0_HALTEN" offset="1448" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB0_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB0_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB0_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB0_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB1_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB1_HALTEN" offset="1452" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB1_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB1_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB1_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB1_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB2_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB2_HALTEN" offset="1456" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB2_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB2_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB2_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB2_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB3_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB3_HALTEN" offset="1460" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB3_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB3_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB3_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB3_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB4_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB4_HALTEN" offset="1464" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB4_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB4_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB4_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB4_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB5_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB5_HALTEN" offset="1468" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB5_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB5_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB5_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB5_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB6_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB6_HALTEN" offset="1472" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB6_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB6_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB6_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB6_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB7_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB7_HALTEN" offset="1476" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB7_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB7_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB7_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB7_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB8_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB8_HALTEN" offset="1480" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB8_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB8_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB8_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB8_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB9_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB9_HALTEN" offset="1484" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB9_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB9_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB9_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB9_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP0_HALTEN" acronym="CONTROLSS_CTRL_ECAP0_HALTEN" offset="1488" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP0_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP0_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP0_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP0_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP1_HALTEN" acronym="CONTROLSS_CTRL_ECAP1_HALTEN" offset="1492" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP1_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP1_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP1_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP1_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP2_HALTEN" acronym="CONTROLSS_CTRL_ECAP2_HALTEN" offset="1496" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP2_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP2_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP2_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP2_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP3_HALTEN" acronym="CONTROLSS_CTRL_ECAP3_HALTEN" offset="1500" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP3_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP3_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP3_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP3_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP4_HALTEN" acronym="CONTROLSS_CTRL_ECAP4_HALTEN" offset="1504" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP4_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP4_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
